In [6]:
import pandas as pd
df = pd.read_csv('/content/lecture 4/example.csv')
print(df)

     Name  Age         City  Gender
0    John   26     New York    Male
1    Jane   31  Los Angeles  Female
2   Alice   22      Chicago  Female
3     Bob   45      Houston    Male
4   Carol   37      Phoenix  Female
5    John   26     New York  Female
6    Jane   29  Los Angeles  Female
7   Alice   24      Chicago    Male
8     Bob   40      Houston  Female
9   Carol   33      Phoenix    Male
10   John   26     New York  Female
11   Jane   28  Los Angeles    Male
12  Alice   30      Chicago  Female
13    Bob   39      Houston    Male
14  Carol   26      Phoenix  Female
15   John   26     New York  Female
16   Jane   35  Los Angeles  Female
17  Alice   25      Chicago    Male
18    Bob   41      Houston  Female
19  Carol   38      Phoenix  Female
20   John   26     New York    Male
21   Jane   27  Los Angeles  Female
22  Alice   21      Chicago  Female
23    Bob   44      Houston    Male
24  Carol   32      Phoenix  Female
25   John   26     New York  Female
26   Jane   30  Los Angeles    Male
27  Alice   23      Chicago  Female
28    Bob   46      Houston  Female
29  Carol   34      Phoenix    Male
30   John   26     New York  Female
31   Jane   32  Los Angeles  Female
32  Alice   26      Chicago    Male
33    Bob   43      Houston  Female
34  Carol   30      Phoenix  Female
35   John   26     New York    Male
36   Jane   28  Los Angeles  Female
37  Alice   27      Chicago  Female
38    Bob   42      Houston    Male
39  Carol   29      Phoenix  Female
40   John   26     New York  Female
41   Jane   34  Los Angeles    Male
42  Alice   22      Chicago  Female
43    Bob   40      Houston  Female
44  Carol   35      Phoenix    Male
45   John   26     New York  Female
46   Jane   31  Los Angeles  Female
47  Alice   24      Chicago    Male
48    Bob   38      Houston  Female
49  Carol   36      Phoenix  Female
50   John   26     New York    Male
51   Jane   29  Los Angeles  Female
52  Alice   25      Chicago  Female
53    Bob   42      Houston    Male
54  Carol   33      Phoenix  Female

In [7]:
print(df.head())

    Name  Age         City  Gender
0   John   26     New York    Male
1   Jane   31  Los Angeles  Female
2  Alice   22      Chicago  Female
3    Bob   45      Houston    Male
4  Carol   37      Phoenix  Female

In [8]:
print(df.describe())

             Age
count  55.000000
mean   31.127273
std     6.675146
min    21.000000
25%    26.000000
50%    29.000000
75%    35.500000
max    46.000000

In [9]:
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 55 entries, 0 to 54
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    55 non-null     object
 1   Age     55 non-null     int64
 2   City    55 non-null     object
 3   Gender  55 non-null     object
dtypes: int64(1), object(3)
memory usage: 1.8+ KB
None

In [10]:
ages = df['Age']

In [11]:
subset = df[['Name', 'City']]

In [12]:
young_people = df[df['Age'] < 30]